content/experience/five-guys-crew-member.md
+++
title = "Crew Member"
author = ["desktop"]
date = 2015-07-01
layout = "list"
lastmod = 2025-12-10T15:25:20-07:00
draft = false
company = "Five Guys"
location = "Salt Lake City, Utah"
type = "Part-Time"
end_date = "Feb 2016"
summary = "Required versatility and a commitment to quality across all kitchen and customer-facing operations. Mastered every workstation in a rotational system."
outcomes = "Maintained high standards of order accuracy and timeliness, contributing to a positive customer experience and the efficient operation of the restaurant."
competencies = ["Operations", "Customer Service", "Teamwork"]
+++

## Key Accomplishments {#key-accomplishments}


### High-Quality Service in a High-Volume Environment {#high-quality-service-in-a-high-volume-environment}

-   **Situation:** Maintaining speed and accuracy was critical in a high-volume kitchen.
-   **Task:** To ensure orders were prepared accurately and delivered in a timely manner.
-   **Action:** Diligently followed all procedures for order taking, food preparation, and quality checks.
-   **Result:** Maintained high standards of order accuracy and timeliness.


### Food Safety and Certification {#food-safety-and-certification}

-   **Situation:** Food service requires strict adherence to health and safety standards.
-   **Task:** To consistently ensure orders were prepared safely.
-   **Action:** Diligently followed all safety procedures.
-   **Result:** Maintained high standards of safety and contributed to efficient operation.


### Versatile Kitchen Operations {#versatile-kitchen-operations}

-   **Situation:** The operational model relies on a rotational system where crew members must be proficient in all areas.
-   **Task:** To operate all kitchen workstations effectively.
-   **Action:** Actively participated in the rotational system, gaining proficiency at each station.
-   **Result:** Became a versatile and reliable team member capable of operating any station.


### Daily Operational Procedures {#daily-operational-procedures}

-   **Situation:** Daily readiness depended on precise execution of opening and closing procedures.
-   **Task:** To perform all required opening and closing duties.
-   **Action:** Executed daily opening procedures (food prep) and nightly closing procedures (cleaning).
-   **Result:** Ensured the restaurant was fully prepared for business and properly secured.


### Customer Service and Environment Management {#customer-service-and-environment-management}

-   **Situation:** Role included direct customer interaction.
-   **Task:** To manage customer transactions and maintain the lobby.
-   **Action:** Operated the POS system efficiently and monitored lobby cleanliness.
-   **Result:** Provided friendly customer service and maintained a welcoming environment.
